posts/2026-04-29-functional-programmers-need-to-take-a-look-at-zig.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 29 April 2026 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Functional Programmers need to take a look at Zig.</title>
<meta name="author" content="doyougnu" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Functional Programmers need to take a look at Zig.</h1>
<p>
I&rsquo;ve been tinkering around with Zig to explore what&rsquo;s possible with comptime.
Whenever I evaluate a new language I use three axes:
</p>

<ol class="org-ol">
<li>How well can I express my ideas in this language. Or in other words, how easy
is it for me to express the domain of the program. This is a test on how much
noise is applied to the ideas I want to express in the program. Noise is
anything that must be written for the program to function that is not
relevant to the domain. For example, the canonical example of noise is the
need to do manual memory management. We must allocate memory for the program
to run, but this is orthogonal to the program&rsquo;s domain; its an implementation
detail.</li>

<li>What facilities does the language provide me to create
correct-by-construction systems and how easily can I program the type-system.
This is essentially a test on how well I can program the language itself or
how well I can create a deep embedding.</li>

<li>What is the mean-time to a surprise. In the study of vacuum systems (think
outer space) there is a concept called the <i>mean-free path length</i> or just
<i>mean-free path</i>. The <i>mean-free path</i> of a vacuum system is the average
distance a particle can travel in the system <i>without</i> experiencing a
collision, it is essentially a metric of how good the vacuum is. When I apply
this concept to programming languages I think of it as &ldquo;How much code can I
write before my implementation differs from my understanding of the system I
am implementing&rdquo;. This is why I frame this metric as a &ldquo;surprise&rdquo;; its &ldquo;how
many lines of code can I write until I experience a surprise&rdquo;. And a surprise
is a delta between what I think I&rsquo;ve implemented and what I&rsquo;ve actually
implemented.</li>
</ol>


<p>
Enter Zig. I&rsquo;m interested in Zig for a few reasons. First, I suspect that
comptime is a simpler and more flexible system to achieve a lot of the
type-system programming I&rsquo;ve seen in the Haskell-verse and I&rsquo;ve done enough
Haskell (over 10 years) that programming the type system is now a hard
requirement for me to take any language seriously.
</p>

<p>
Second, I am desperately trying to avoid writing a functional systems language.
This is probably a blog post in its own right but the programming language
industry has not grokked the meaning of monads. Monads are not some kind of
obscure math-y thing that only the big brains think are necessary. No, instead
monads are a fundamental abstract algebraic description of imperative
programming as a computational context. They allow a programming language to not
have a built-in notion of time (among other things). So if I want an imperative
programming language I can implement <code>MonadCont</code> (the continuation monad), if I
want a logic programming language I can implement <code>LogicT</code> (a monad that has
non-deterministic semantics and backtracking). Not having a built-in notion of
time means that my language is de-facto more expressive, allows users to mold
the language to their needs, and improves the optimization ceiling compilers for
that language can achieve.
</p>

<p>
So how does this connect with systems programming? Well, I&rsquo;ve been radicalized.
I&rsquo;ve learned enough performance-oriented programming to be dissatisfied with the
common functional languages (Haskell, OCaml, Common Lisp/Clojure, Scheme)
because each of these languages are predicated on the existence of garbage
collection and heaps. I think we are at the tail end of a large scale experiment
with garbage collection. We can now look back on the last 30 years and conclude
that garbage collection does communicate immense value by reducing noise, but
the tradeoff is that the one ends up with a forest of pointers into the heap and
that will always create a performance ceiling for the program and language
implementation.
</p>

<p>
To exacerbate matters, I think there is a cognitive risk to garbage collection.
Garbage collection makes it <i>too easy</i> to not think about or care about the
underlying machine and runtime system. This has created a generation of
developers who never gained or have lost the knowledge of how programs actually
execute on a computational machine. Or to use less flowery language, just look
at the era of software that garbage collectors have ushered in. Programs are
bloated, slow, and wasteful compared to the literal super-computers that are
running them. Surely we can do better.
</p>

<p>
Furthermore, I think the value proposition of garbage collectors has changed.
The first garbage collector was innovated in LISP in 1957, but once they gained
prominence in 1995 due to Java they proliferated, and for good reason. However,
the machines of 2026 are much different than the machines of 1995 (but our
languages aren&rsquo;t ). Since 1995, compute on a CPU has grown something like 10,000
times faster while memory access timing has lagged. That was not the case
in 1995. In 1995 these were roughly comparable. So we are in a situation where
we are using languages designed for the machines of yesteryear that do not
consider the machines of today. As an industry we (largely) have stopped
innovating on new languages.
</p>

<p>
I once saw a talk by Steven Diehl that asked <a href="https://web.archive.org/web/20220325175116/http://dev.stephendiehl.com/nearfuture.pdf">Where the next Programming Language
will come from?</a> that beautifully described the sad state of things. His main
point is that the incentives for programming language innovation are at best
misaligned and at worst non-existent. He states that we can assume there are
three groups of people that are capable of innovation: Academics, Industry, and
Hobbyists. But academics have no incentive to do the real-world engineering
required to make a viable programming language, and any academics who decide to
try are committing career suicide. Industry cannot fund any long-term projects
(due to its culture of shareholder-value maximization) and are tied into sticky
network effects. Hobbyists (generally) don&rsquo;t have the time nor the economic
means to make something real; which takes decades of full time work to
accomplish. And so we are stuck with a local maxima.
</p>

<p>
Okay now back to Zig. I&rsquo;m bullish on Zig because Zig (and its BDFL <a href="https://andrewkelley.me/">Andrew
Kelley</a>) are innovating and <i>have the courage</i> to innovate. Here are some
innovations. Zig discourages the forest of pointers approach and encourages
better manual memory management through Arenas and Allocators. This means that
users have much more control over the memory management of their programs. This
is just one reason why stuff written in Zig is so damn fast; Zig programs tend
to exploit the machines of today better than the machines of yesteryear. <a href="https://ziglang.org/download/0.16.0/release-notes.html">Zig
0.16</a> just released and reworked the IO system to an interface design, here is
the example from the release notes:
</p>

<div class="org-src-container">
<pre class="src src-zig"><span class="org-keyword">const</span> <span class="org-variable-name">std</span> = <span class="org-builtin">@import</span>(<span class="org-string">"std"</span>);
<span class="org-keyword">const</span> <span class="org-variable-name">Io</span> = std.Io;

<span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">main</span>(<span class="org-variable-name">init</span>: <span class="org-type">std.process.Init</span>) !<span class="org-type">void</span> {
    <span class="org-keyword">const</span> <span class="org-variable-name">gpa</span> = init.gpa;
    <span class="org-keyword">const</span> <span class="org-variable-name">io</span> = init.io;

    <span class="org-keyword">const</span> <span class="org-variable-name">args</span> = <span class="org-keyword">try</span> init.minimal.args.toSlice(init.arena.allocator());

    <span class="org-keyword">const</span> <span class="org-variable-name">host_name</span>: <span class="org-type">Io.net.HostName</span> = <span class="org-keyword">try</span> .init(args[1]);

    <span class="org-keyword">var</span> <span class="org-variable-name">http_client</span>: <span class="org-type">std.http.Client</span> = .{ .allocator = gpa, .io = io };
    <span class="org-keyword">defer</span> http_client.deinit();
...
}
</pre>
</div>

<p>
You know what I see when I look at this code? I see <code>http_client</code> as existing in
a <code>Reader</code> monad that contains an allocator and an <code>IO</code> interface. This is
exactly how the <code>IO</code> monad (and for that matter <code>IO#</code>) works in Haskell. The
fact that the Zig people came up with this <i>independantly</i> speaks not just to
the universal nature of monads (and the algebraic structures of programming
languages) but also tells me that they are absolutely on the right track. Kudos
to that team! I even <a href="https://news.ycombinator.com/item?id=46123083">mentioned</a> as much on the orange website which set off a
great discussion for those that are interested.
</p>

<p>
My last example is comptime. Recall that I want to be able to create
correct-by-construction programs. This means that I need nominal typing. Well a
Haskell-like <code>newtype</code>. In Zig is just a singleton struct:
</p>

<div class="org-src-container">
<pre class="src src-zig"><span class="org-keyword">struct</span> PlayerHealth {
  <span class="org-variable-name">health</span>: <span class="org-type">u32</span>
}
</pre>
</div>

<p>
Nice! Okay what about a sum type. Easy that&rsquo;s just a union:
</p>

<div class="org-src-container">
<pre class="src src-zig">  <span class="org-keyword">const</span> <span class="org-variable-name">std</span> = <span class="org-builtin">@import</span>(<span class="org-string">"std"</span>);

  <span class="org-comment-delimiter">// </span><span class="org-comment">the venerable Maybe, even though Zig has builtin syntax for this
</span>  <span class="org-keyword">fn</span> <span class="org-function-name">Maybe</span>(<span class="org-keyword">comptime</span> <span class="org-variable-name">T</span>: <span class="org-type">type</span>) <span class="org-type">type</span> {
    <span class="org-keyword">return</span> <span class="org-keyword">union</span>(<span class="org-keyword">enum</span>) {
        <span class="org-variable-name">value</span>: <span class="org-type">T</span>,
        nothing,

        <span class="org-keyword">const</span> <span class="org-variable-name">Self</span> = <span class="org-builtin">@This</span>();

        <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">just</span>(<span class="org-variable-name">the_val</span>: <span class="org-type">T</span>) Self   { <span class="org-keyword">return</span> .{ .value = the_val }; }
        <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">nothing</span>() Self          { <span class="org-keyword">return</span> .nothing; }

        <span class="org-comment-delimiter">// </span><span class="org-comment">this is fmap and exhibits a Haskell-like case expression
</span>        <span class="org-comment-delimiter">// </span><span class="org-comment">map :: Maybe(T) -&gt; Maybe(B)
</span>        <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">map</span>(<span class="org-variable-name">self</span>: <span class="org-type">Self</span>, <span class="org-keyword">comptime</span> <span class="org-variable-name">B</span>: <span class="org-type">type</span>, <span class="org-variable-name">f</span>: <span class="org-keyword">fn</span> (T) B) Maybe(B) {
            <span class="org-keyword">return</span> <span class="org-keyword">switch</span> (self) {
                .value =&gt; |v| .{ .value = f(v) }, <span class="org-comment-delimiter">// </span><span class="org-comment">the Just case
</span>                .nothing =&gt; .nothing,
            };
        }
    };
}
</pre>
</div>

<p>
Very nice! What about typeclasses? Again <code>comptime</code> and <code>structs</code> are the way:
</p>

<div class="org-src-container">
<pre class="src src-zig">    <span class="org-keyword">const</span> <span class="org-variable-name">std</span> = <span class="org-builtin">@import</span>(<span class="org-string">"std"</span>);

    <span class="org-comment-delimiter">// </span><span class="org-comment">This is: class Eq where ...
</span>    <span class="org-keyword">fn</span> <span class="org-function-name">Eq</span>(<span class="org-keyword">comptime</span> <span class="org-variable-name">T</span>: <span class="org-type">type</span>) <span class="org-type">type</span> {
      <span class="org-comment-delimiter">// </span><span class="org-comment">Observe that we can not only program at compile time
</span>      <span class="org-comment-delimiter">// </span><span class="org-comment">but also write our own error messages _and_ the language encourages
</span>      <span class="org-comment-delimiter">// </span><span class="org-comment">us to do this
</span>      <span class="org-keyword">if</span> (!<span class="org-builtin">@hasDecl</span>(T, <span class="org-string">"eql"</span>)) <span class="org-comment-delimiter">// </span><span class="org-comment">this says that T must have an `eql` method
</span>          <span class="org-builtin">@compileError</span>(<span class="org-builtin">@typeName</span>(T) ++ <span class="org-string">" must implement eql(T, T) bool"</span>);

      <span class="org-keyword">return</span> <span class="org-keyword">struct</span> {
          <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">eql</span>(<span class="org-variable-name">a</span>: <span class="org-type">T</span>, <span class="org-variable-name">b</span>: <span class="org-type">T</span>) <span class="org-type">bool</span> { <span class="org-keyword">return</span> T.eql(a, b); }
          <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">neq</span>(<span class="org-variable-name">a</span>: <span class="org-type">T</span>, <span class="org-variable-name">b</span>: <span class="org-type">T</span>) <span class="org-type">bool</span> { <span class="org-keyword">return</span> !T.eql(a, b); }
      };
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">A user defined type
</span>    <span class="org-keyword">const</span> <span class="org-variable-name">Point</span> = <span class="org-keyword">struct</span> {
      <span class="org-variable-name">x</span>: <span class="org-type">i32</span>,
      <span class="org-variable-name">y</span>: <span class="org-type">i32</span>,

      <span class="org-comment-delimiter">// </span><span class="org-comment">instance Eq Point where ...
</span>      <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">eql</span>(<span class="org-variable-name">a</span>: <span class="org-type">Point</span>, <span class="org-variable-name">b</span>: <span class="org-type">Point</span>) <span class="org-type">bool</span> {
          <span class="org-keyword">return</span> a.x == b.x <span class="org-keyword">and</span> a.y == b.y;
      }
  };

  <span class="org-comment-delimiter">// </span><span class="org-comment">now use it
</span>  <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">main</span>() <span class="org-type">void</span> {
    <span class="org-keyword">const</span> <span class="org-variable-name">EqPoint</span> = Eq(Point);
    <span class="org-keyword">const</span> <span class="org-variable-name">a</span> = Point{ .x = 1, .y = 2 };
    <span class="org-keyword">const</span> <span class="org-variable-name">b</span> = Point{ .x = 1, .y = 2 };
    <span class="org-keyword">const</span> <span class="org-variable-name">c</span> = Point{ .x = 3, .y = 4 };

    std.debug.print(<span class="org-string">"a == c: {}\n"</span>, .{EqPoint.eql(a, c)});  <span class="org-comment-delimiter">// </span><span class="org-comment">false
</span>    std.debug.print(<span class="org-string">"a == b: {}\n"</span>, .{EqPoint.eql(a, b)});  <span class="org-comment-delimiter">// </span><span class="org-comment">true
</span>}
</pre>
</div>

<p>
You&rsquo;ll notice that this is a but clunky; we have to instantiate a <code>Eq(Point)</code>
and then call <code>EqPoint.eql</code>. <code>EqPoint</code> is essentially the typeclass dictionary
that Haskell creates behind the scenes, and so in Zig we have to manually pass
that dictionary around. The good part is that this comports with Zig&rsquo;s &ldquo;no
spooky action at a distance&rdquo; philosophy, typeclass dictionary passing is
spooky-action at a distance. But we can make this more ergonomic by just
deriving <code>Eq</code> on our <code>Point</code> type:
</p>

<div class="org-src-container">
<pre class="src src-zig">
<span class="org-keyword">const</span> <span class="org-variable-name">std</span> = <span class="org-builtin">@import</span>(<span class="org-string">"std"</span>);

<span class="org-keyword">fn</span> <span class="org-function-name">EqClass</span>(<span class="org-keyword">comptime</span> <span class="org-variable-name">T</span>: <span class="org-type">type</span>) <span class="org-type">type</span> {
    <span class="org-keyword">if</span> (!<span class="org-builtin">@hasDecl</span>(T, <span class="org-string">"eqlImpl"</span>)) <span class="org-comment-delimiter">// </span><span class="org-comment">now we verify there is an instance implementation
</span>        <span class="org-builtin">@compileError</span>(<span class="org-builtin">@typeName</span>(T) ++ <span class="org-string">" must implement eqlImpl(T, T) bool"</span>);

    <span class="org-keyword">return</span> <span class="org-keyword">struct</span> {
        <span class="org-comment-delimiter">// </span><span class="org-comment">and these functions just wrap the implementation provided by T
</span>        <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">eql</span>(<span class="org-variable-name">a</span>: <span class="org-type">T</span>, <span class="org-variable-name">b</span>: <span class="org-type">T</span>) <span class="org-type">bool</span> { <span class="org-keyword">return</span> T.eqlImpl(a, b); }
        <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">neq</span>(<span class="org-variable-name">a</span>: <span class="org-type">T</span>, <span class="org-variable-name">b</span>: <span class="org-type">T</span>) <span class="org-type">bool</span> { <span class="org-keyword">return</span> !T.eqlImpl(a, b); }
    };
}

<span class="org-keyword">const</span> <span class="org-variable-name">Point</span> = <span class="org-keyword">struct</span> {
    <span class="org-variable-name">x</span>: <span class="org-type">i32</span>,
    <span class="org-variable-name">y</span>: <span class="org-type">i32</span>,

    <span class="org-comment-delimiter">// </span><span class="org-comment">the actual implementation, this is the body of (==) in the instance
</span>    <span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">eqlImpl</span>(<span class="org-variable-name">a</span>: <span class="org-type">Point</span>, <span class="org-variable-name">b</span>: <span class="org-type">Point</span>) <span class="org-type">bool</span> {
        <span class="org-keyword">return</span> a.x == b.x <span class="org-keyword">and</span> a.y == b.y;
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">derive Eq: EqClass reads eqlImpl above so we don't create a cycle
</span>    <span class="org-keyword">pub</span> <span class="org-keyword">const</span> <span class="org-variable-name">Eq</span> = EqClass(<span class="org-builtin">@This</span>());
};

<span class="org-keyword">pub</span> <span class="org-keyword">fn</span> <span class="org-function-name">main</span>() <span class="org-type">void</span> {
    <span class="org-keyword">const</span> <span class="org-variable-name">a</span> = Point{ .x = 1, .y = 2 };
    <span class="org-keyword">const</span> <span class="org-variable-name">b</span> = Point{ .x = 1, .y = 2 };
    <span class="org-keyword">const</span> <span class="org-variable-name">c</span> = Point{ .x = 3, .y = 4 };

    std.debug.print(<span class="org-string">"a == c: {}\n"</span>, .{Point.Eq.eql(a, c)});  <span class="org-comment-delimiter">// </span><span class="org-comment">false
</span>    std.debug.print(<span class="org-string">"a == b: {}\n"</span>, .{Point.Eq.eql(a, b)});  <span class="org-comment-delimiter">// </span><span class="org-comment">true
</span>    std.debug.print(<span class="org-string">"a != c: {}\n"</span>, .{Point.Eq.neq(a, c)});  <span class="org-comment-delimiter">// </span><span class="org-comment">true
</span>}
</pre>
</div>

<p>
Not bad. Its less ergonomic than Haskell for sure but I think that&rsquo;s a good
thing. In fact, I look at this, squint really hard and see something like an ML
module system hiding behind the scenes. I could go on. In fact, in Zig you can
use structs to create closures, to curry, and therefore write higher-ordered
functions all without a garbage collector. But I&rsquo;ll save that for another post.
</p>

<p>
Needless to say I&rsquo;m bullish on Zig. I think Zig is doing so much right. Zig has
what I need and want to express my domain and ideas succinctly (this was 1. in
my original criteria). Zig&rsquo;s comptime has very good support for programming the
type system and creating correct-by-construction programs. I still have to
experiment more with it, but I think it is atleast in the ball park of Haskell
and easier to program at that (this was 2.). Finally, Zig&rsquo;s &ldquo;no spooky action at
a distance&rdquo; means I have not once been surprised about the semantics in my
experimentation. I&rsquo;m sure there will be edge cases but I can confidentally say
that Zig has a greater mean free path length than languages that its often
positioned against: Rust, C++ (for sure). I love Haskell and its been my go to
language for the last 10-13 years but god damn I see a lot of Zig in my future.
</p>
</div>
<div id="postamble" class="status">
<hr>
               <div class='author-info' style='text-align:center; margin-top: 2em; font-style: italic;'>
                 Written by <a href='/me.html' class='author-link'>doyougnu</a>
                 on <span class='timestamp'>2026-04-29</span>
               </div>
               <div class='botnav' style='text-align:center; margin-top: 2em;'>
                  <a href='/index.html'>Blog</a>
                  <a href='/publications.html'>Publications</a>
                  <a href='https://github.com/doyougnu'>Github</a>
                  <a href='/me.html'>About</a>
               </div>
</div>
</body>
</html>
